# Merging DataFrames

In [1]:
import pandas as pd

## Our Dataset
- Our datasets are spread across multiple files in this section. Each file has a `restaurant_` prefix.
- The `customers.csv` file stores our restaurant's customers.
- The `foods.csv` file stores our restaurant's menu items.
- The `week_1_sales` and `week_2_sales` files store our orders.

In [5]:
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

## The pd.concat Function I
- The `concat` function concatenates one **DataFrame** to the end of another.
- The original index labels will be kept by default. Set `ignore_index` to True to generate a new index.
- The `keys` parameter create a **MultiIndex** using the specified keys/labels.

In [7]:
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

In [8]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [9]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [11]:
print(len(week1))
print(len(week2))

250
250

In [20]:
pd.concat([week1, week2])
pd.concat([week1, week2], ignore_index= False) # the default value of this parameter is, indeed false

# and by using the function that way, pandas will keep the original index from both dataframes that are being concatenated together

pd.concat([week1, week2], ignore_index= True) # with the true value, pandas ignore the initial indexes, and generates an entire new one

pd.concat([week1, week2], keys= ['week1', 'week2']) # the 'keys' parameter must be a list of strings and have same amount of items as the dataframes we are trying to concat
# it will work as a label for the objects we are dealing with (return a multi-index dataframe: the defined keys + the original/regenerated labels )

           Customer ID  Food ID
week1 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

## The pd.concat Function II
- Pandas will concatenate the **DataFrames** along the row/index axis.
- Pandas will include all columns that exist in either **DataFrame**. If there are no matching values, pandas will use `NaN` values.
- We can pass the `axis` parameter an argument of `"columns"` to concatenate on the column axis.

In [22]:
df1= pd.DataFrame([1,2,3], columns=['A'])
df1

   A
0  1
1  2
2  3

In [23]:
df2= pd.DataFrame([4,5,6], columns=['B'])
df2

   B
0  4
1  5
2  6

In [26]:
pd.concat([df1, df2])
pd.concat([df1, df2], axis= 'index') # same results

# but we can change the "concatenation direction" and define that we want to add data on the horizontal scale (columns) instead of vertical one (rows/index)
pd.concat([df1, df2], axis= 'columns')

   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
# the tip is: try to prepare both datframes we are looking to concatenate as much similiar as possible before performing sich activity, because it will make the operation easier

## Left Joins
- The `merge` method joins two **DataFrames** together based on shared values in a column or an index.
- A left join merges one **DataFrame** into another based on values in the first one.
- The "left" **DataFrame** is the one we invoke the `merge` method on.
- If the left **DataFrame's** value is not found in the right **DataFrame**, the row will hold `NaN` values.
<img src="SQL_Joins.png" width="800" height="800"/>

In [27]:
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

In [30]:
display(week1.head())
display(foods.head())

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [32]:
week1.merge(foods, how= 'left', on= 'Food ID')

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

## The left_on and right_on Parameters
- The `left_on` and `right_on` parameters designate the column names from each **DataFrame** to use in the merge.
- This is especially when the dataframes have different column names referring to the same id data

In [33]:
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

In [34]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [35]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [37]:
week2.merge(customers, how='left', left_on='Customer ID', right_on='ID').drop(columns='ID')

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

## Inner Joins I
- Inner joins merge two tables based on *shared*/*common* values in columns.
- If only one **DataFrame** has a value, pandas will exclude it from the final results set.
- If the same ID occurs multiple times, pandas will store each possible combination of the values.
- The design of the join ensures that the results will be the same no matter what **DataFrame** the `merge` method is invoked upon.
<img src="SQL_Joins.png" width="800" height="800"/>

In [12]:
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

In [13]:
display(week1.head())
print()

display(week2.head())

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [14]:
week1.merge(week2, how= 'inner', on= 'Customer ID').head()

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8
4          503          5          9

In [15]:
# In this case we have columns with the same names in both dataframes, and that's why we get the suffixes '_x' and '_y' after them (to check that they are from different dataframes).

# those suffixes come as pandas default, but we can properly change it

pd.merge(week1, week2, how= 'inner', on= 'Customer ID', suffixes= [' - Week1', ' - Week2']).head()

   Customer ID  Food ID - Week1  Food ID - Week2
0          537                9                5
1          155                9                3
2          155                1                3
3          503                5                8
4          503                5                9

In [16]:
# It's important to notice that for some customers we have more than one row. It happens because those customers may have appeared more than once in some dataframe. So the inner parameter returns all the possible combinations as a result. We can see this happening with the customers 155 and 503 in the query above.

display(week1[week1['Customer ID'] == 155])
display(week2[week2['Customer ID'] == 155]) 

print()

display(week1[week1['Customer ID'] == 503])
display(week2[week2['Customer ID'] == 503])

    Customer ID  Food ID
4           155        9
17          155        1

     Customer ID  Food ID
208          155        3

   Customer ID  Food ID
7          503        5

     Customer ID  Food ID
69           503        8
180          503        9

- The result of final rows in the merged dataframe is always the cross product of combinations associated to the merge key: (Number of appearances in the first data frame) X (Number of appearances in the second data frame)

## Inner Joins II
- We can pass multiple arguments to the `on` parameter of the `merge` method. Pandas will require matches in both columns across the **DataFrames**.

In [17]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [18]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [20]:
# we can restrict the merge condition by passing a list of columns we want to be connected
pd.merge(week1, week2, how= 'inner', on= ['Customer ID', 'Food ID']).sort_values(by=['Customer ID', 'Food ID'])

   Customer ID  Food ID
4           21        4
5           21        4
3          233        3
0          304        3
1          540        3
7          578        5
8          578        5
6          922        1
2          937       10

In [22]:
# if a customer/food appears more than once, it means that the merge key combination has also appeared more than once in some data frame
# example:

display(week1[week1['Customer ID'] == 21])
display(week2[week2['Customer ID'] == 21])

     Customer ID  Food ID
101           21        4
212           21        4

    Customer ID  Food ID
30           21        4

In [ ]:
# this syntax can also be applied with left/right joins and with left_on/right_on parameters (we only need to be aware about the correct order of the fields we want to connect)

## Chat GPT Exercises I

In [9]:
import pandas as pd
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

In [18]:
foods.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [10]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [29]:
#1) Merge the Customers dataframe with Week1 using an inner join to find the customer details for all customers who made purchases in Week 1. Extract only the following columns from the resulting dataframe: First Name, Last Name, Gender, and Food ID.

week1\
    .merge(customers, how= 'inner', left_on= 'Customer ID', right_on= 'ID')\
    .merge(foods, how= 'inner', on= 'Food ID')\
    .drop(columns=['ID'])\
    .loc[ :, ['Customer ID', 'Food ID', 'First Name', 'Last Name', 'Gender', 'Food Item', 'Price']]\
    .drop_duplicates()\
    .sort_values(by= ['Customer ID', 'Food ID'], ascending= [True, True])

     Customer ID  Food ID First Name Last Name  Gender   Food Item  Price
90             3        2      Roger     Black    Male     Burrito   9.99
97            10        2     Steven      Ryan    Male     Burrito   9.99
60            20        1       Lisa      Rice  Female       Sushi   3.99
45            21        4     Albert     Burns    Male  Quesadilla   4.25
19            26        9   Michelle     Kelly  Female       Donut   0.99
..           ...      ...        ...       ...     ...         ...    ...
130          966        5     Robert      Ford    Male       Pizza   2.49
74           968        1     Teresa  Reynolds  Female       Sushi   3.99
143          985        5      Julia     Ortiz  Female       Pizza   2.49
104          991        2    Melissa     Wells  Female     Burrito   9.99
98          1000        2      Brian   Daniels    Male     Burrito   9.99

[248 rows x 7 columns]

In [47]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [2]:
#2) Perform a left join of the Foods dataframe with Week2 to determine all the food items available, including those that were not purchased in Week 2. From the result, filter the rows where no purchases were made (Food ID is null). Extract the Food Item and Price columns.

df= foods.merge(week2, how= 'left', on= 'Food ID')
df[ df['Customer ID'].isna() ]

df= pd.merge(foods, week2, how= 'left', on= 'Food ID')
df[ df['Customer ID'].isna() ]

Empty DataFrame
Columns: [Food ID, Food Item, Price, Customer ID]
Index: []

In [50]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [49]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [60]:
#3) Merge the Customers dataframe with both Week1 and Foods using a series of inner joins to find the names of all customers and the food items they purchased in Week 1. Filter the result to include only customers who purchased food items costing more than $10. Extract the First Name, Last Name, and Food Item columns.

df= customers\
    .merge(week1, how= 'inner', left_on= 'ID', right_on= 'Customer ID')\
    .merge(foods, how= 'inner', on= 'Food ID')
df.head()

row_condition= df['Price'] > 10
columns_to_extract= ['First Name', 'Last Name', 'Food Item', 'Price']

df.loc[ row_condition, columns_to_extract ].drop_duplicates()

    First Name   Last Name Food Item  Price
106       Earl    Marshall     Steak  24.99
107      Donna  Cunningham     Steak  24.99
108     Robert     Kennedy     Steak  24.99
109       Lois      Howard     Steak  24.99
110     Jeremy      Nelson     Steak  24.99
..         ...         ...       ...    ...
222     Rachel      Willis     Pasta  13.99
223   Virginia      Oliver     Pasta  13.99
224      Kelly      Hunter     Pasta  13.99
225       Anne      Wagner     Pasta  13.99
226    Carolyn      Garcia     Pasta  13.99

[78 rows x 4 columns]

In [75]:
#4) Perform a right join between Customers and Week2 to get a list of all customers who made purchases in Week 2, along with the Food ID they purchased. Then, filter the result to include only customers whose occupation is "Engineer". Extract the First Name, Last Name, and Food ID columns.

df= customers.merge(week2, how= 'right', left_on= 'ID', right_on= 'Customer ID')
df.head()

df.loc[ df['Occupation'].apply(lambda value: 'Engineer' in value) , ['First Name', 'Last Name', 'Occupation', 'Food ID'] ].head()

   First Name Last Name                   Occupation  Food ID
4     Matthew      Wood             Product Engineer        3
24       Ruth   Alvarez  Mechanical Systems Engineer        2
36    Beverly    Fuller                  Engineer II        3
47       Gary   Russell     Software Test Engineer I       10
57     Denise     Green    Software Test Engineer IV        8

In [79]:
display(week1.loc[week1['Customer ID'] == 537])
display(week2.loc[week2['Customer ID'] == 537])

   Customer ID  Food ID
0          537        9

    Customer ID  Food ID
42          537        5

In [85]:
#5) Merge Week1 with Week2 using an inner join on Customer ID to find customers who made purchases in both weeks. Then, merge this result with the Customers dataframe to get the customer details. Extract the Customer ID, First Name, and Last Name columns.

columns_to_extract= ['Customer ID', 'First Name', 'Last Name']
week1\
    .merge(week2, how= 'inner', on= 'Customer ID')\
    .merge(customers, left_on= 'Customer ID', right_on= 'ID')\ 
    [columns_to_extract]\
    .drop_duplicates()\
    .sort_values(by= 'Customer ID')\
    .head()

# merge has 'inner' as default of the parameter 'how'

    Customer ID First Name  Last Name
29           21     Albert      Burns
20           30     Pamela      Hicks
43           45       Earl   Marshall
7            75  Catherine  Carpenter
8            77       Lori    Edwards

## Full/Outer Join
- A **full/outer** joins values that are found in either **DataFrame** or both **DataFrames**.
- Pandas does not mind if a value exists in one **DataFrame** but not the other.
- If a value does not exist in one **DataFrame**, it will have a `NaN`.

<img src="SQL_Joins.png" width="800" height="800"/>

In [32]:
import pandas as pd
foods= pd.read_csv('restaurant_foods.csv')
customers= pd.read_csv('restaurant_customers.csv')
week1= pd.read_csv('restaurant_week_1_sales.csv')
week2= pd.read_csv('restaurant_week_2_sales.csv')

In [44]:
week1.merge(week2, how= 'outer', on= 'Customer ID')
week1.merge(week2, how= 'outer', on= 'Customer ID', suffixes= [' - Week1', ' - Week2'], indicator= True)

     Customer ID  Food ID - Week1  Food ID - Week2      _merge
0            537              9.0              5.0        both
1             97              4.0              NaN   left_only
2            658              1.0              NaN   left_only
3            202              2.0              NaN   left_only
4            155              9.0              3.0        both
..           ...              ...              ...         ...
449          855              NaN              4.0  right_only
450          559              NaN             10.0  right_only
451          276              NaN              4.0  right_only
452          556              NaN             10.0  right_only
453          252              NaN              9.0  right_only

[454 rows x 4 columns]

In [43]:
week1.merge(week2, how= 'outer', on= 'Customer ID', suffixes= [' - Week1', ' - Week2'], indicator= True)['_merge'].value_counts()

_merge
right_only    197
left_only     195
both           62
Name: count, dtype: int64

In [50]:
# This type of join is useful for us in either situations that we indeed want to combine all possible values from both datasets, or that we desire to isolate data that only exist in one specific dataframe. To do that we can filter rows using isna method, but we also can take advantage of the indicator column and filter it

merged= pd.merge(week1, week2, how= 'outer', on= 'Customer ID', suffixes= [' - Week1', ' - Week2'], indicator= True)
merged[
    (merged['_merge'] != 'both') | (merged['_merge'].isin(['left_only', 'right_only']))
    ]
# I know the syntax is redundant, I'm doing it only to review/remind the commands

     Customer ID  Food ID - Week1  Food ID - Week2      _merge
1             97              4.0              NaN   left_only
2            658              1.0              NaN   left_only
3            202              2.0              NaN   left_only
6            213              8.0              NaN   left_only
7            600              1.0              NaN   left_only
..           ...              ...              ...         ...
449          855              NaN              4.0  right_only
450          559              NaN             10.0  right_only
451          276              NaN              4.0  right_only
452          556              NaN             10.0  right_only
453          252              NaN              9.0  right_only

[392 rows x 4 columns]

## Merging by Indexes with the left_index and right_index Parameters
- Use the `on` parameter if the column(s) to be matched on have the same names in both **DataFrames**.
- Use the `left_on` and `right_on` parameters if the column(s) to be matched on have different names in the two **DataFrames**.
- Use the `left_index` or `right_index` parameters (set to True) to if the values to be matched on are found in the index of a **DataFrame**.

## The join Method
- The `join` method is a shortcut for concatenating two **DataFrames** when merging by index labels.